#include <stdio.h>

int main()
{
	/*
	int i = 0;
	int j = 0;
	for(i = 0 ; i < 10 ;i++)
	{
		for(j = 0 ; j < 5 ; j++)
		{
			printf("qwe\n");
		}
	}
	//50
	*/
	// *     	1  ,  1
	// **		2  ,  2
	// ***		3  ,  3
	// ****
	// *****
	// ******
	// *******
	//		*
	//	   ***
	//	  *****
	//	 *******
	//	  *****
	//	   ***
	//		*

	int i = 0;
	int j = 0;
	for(i = 0 ; i < 7; i++)
	{
		for(j = 0; j < i + 1 ; j++)
		{
			printf("*");
		}
		printf("\n");
	}
	//已知质数的规定，除了１和自身，都不能被整除
	// 100之内 所有的质数
	// 13
	

	



	
	return 0;
}
